{"class_name": "Model", "config": {"name": "model_14", "layers": [{"name": "input_14", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 5], "dtype": "float32", "sparse": false, "name": "input_14"}, "inbound_nodes": []}, {"name": "flatten_14", "class_name": "Flatten", "config": {"name": "flatten_14", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_14", 0, 0, {}]]]}, {"name": "fc0", "class_name": "Dense", "config": {"name": "fc0", "trainable": true, "units": 64, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_14", 0, 0, {}]]]}, {"name": "fc2", "class_name": "Dense", "config": {"name": "fc2", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc0", 0, 0, {}]]]}], "input_layers": [["input_14", 0, 0]], "output_layers": [["fc2", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}